# FilterCategoryRule Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterCategoryRule Properties
FilterCategoryRule Class See Also
---
The FilterCategoryRule type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterRule.) |

# See Also
FilterCategoryRule Class
Autodesk.Revit.DB Namespace